Tekla Open API Reference for Tekla Structures 2025
RebarHookDataNullable Properties
The RebarHookDataNullable type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle of the hook. The value is between -270 to +270 degrees.
Length
 Gets or sets the length of the straight part of the hook.
Radius
 Gets or sets the bending radius of the hook.
Rotation
 Gets or sets the rotation of the hook.
Shape
 Gets or sets the shape of the hook. The options are:
NO_HOOK. Sets the angle, radius and length to 0.
HOOK_90_DEGREES.
HOOK_135_DEGREES.
HOOK_180_DEGREES.
CUSTOM_HOOK. The angle, radius and length values have to be set manually.
Top
See Also
Reference
RebarHookDataNullable Class
Tekla.Structures.Model Namespace